Tekla.Structures.ModelInternal.dotBaseComponent_t
Serialization structure for BaseComponent.

Tekla.Structures.ModelInternal.dotBaseComponent_t.ModelObject
Base class

Tekla.Structures.ModelInternal.dotBaseComponent_t.aName
Name of the component

Tekla.Structures.ModelInternal.dotBaseComponent_t.Number
Number of the component

Tekla.Structures.ModelInternal.dotBaseComponent_t.aAttributeFilename
Name of the attribute file we wish to load

Tekla.Structures.ModelInternal.dotBaseComponent_t.aConnectionCode
Connection code

Tekla.Structures.ModelInternal.dotBaseComponent_t.UpVector
UpVector

Tekla.Structures.ModelInternal.dotBaseComponent_t.AutoDirectionType
Auto direction type

Tekla.Structures.ModelInternal.dotBaseComponent_t.PositionType
Position type

Tekla.Structures.ModelInternal.dotBaseComponent_t.DetailType
Detail type

Tekla.Structures.ModelInternal.dotBaseComponent_t.AutoPosition
Auto position type

Tekla.Structures.ModelInternal.dotBaseComponent_t.ErrorStatus
Error status for connection, seam or detail.
Visible in symbol color.

Tekla.Structures.ModelInternal.dotBaseComponent_t.Class
Class of connection/detail/seam.

Tekla.Structures.ModelInternal.dotBaseComponent_t.PrimaryObjectId
Primary object id

Tekla.Structures.ModelInternal.dotBaseComponent_t.nSecondaryObjectIds
Number of secondary object ids

Tekla.Structures.ModelInternal.dotBaseComponent_t.aSecondaryObjectIds
Secondary object ids

Tekla.Structures.ModelInternal.dotBaseComponent_t.nPositions
Number of polygon positions

Tekla.Structures.ModelInternal.dotBaseComponent_t.aX
polygon x coordinates

Tekla.Structures.ModelInternal.dotBaseComponent_t.aY
polygon y coordinates

Tekla.Structures.ModelInternal.dotBaseComponent_t.aZ
polygon z coordinates

Tekla.Structures.ModelInternal.dotBaseComponent_t.CustomPartPosition
The way the custom part is positioned in the model.